In [3]:
import pandas as pd
import numpy as np

# Arithmetic Operation in Pandas

In [7]:
data = pd.DataFrame(np.arange(1,13).reshape(3,4),columns = list('abcd'))
data

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

## Division

In [9]:
data.div(2)

     a    b    c    d
0  0.5  1.0  1.5  2.0
1  2.5  3.0  3.5  4.0
2  4.5  5.0  5.5  6.0

In [10]:
data / 2

     a    b    c    d
0  0.5  1.0  1.5  2.0
1  2.5  3.0  3.5  4.0
2  4.5  5.0  5.5  6.0

## Addition

In [11]:
data + 2

    a   b   c   d
0   3   4   5   6
1   7   8   9  10
2  11  12  13  14

In [12]:
data.add(2)

    a   b   c   d
0   3   4   5   6
1   7   8   9  10
2  11  12  13  14

## Substraction

In [13]:
data - 2

   a  b  c   d
0 -1  0  1   2
1  3  4  5   6
2  7  8  9  10

In [14]:
data.sub(2)

   a  b  c   d
0 -1  0  1   2
1  3  4  5   6
2  7  8  9  10

## Multiplication

In [16]:
data * 2

    a   b   c   d
0   2   4   6   8
1  10  12  14  16
2  18  20  22  24

In [15]:
data.mul(2)

    a   b   c   d
0   2   4   6   8
1  10  12  14  16
2  18  20  22  24

## Power

In [17]:
data ** 2

    a    b    c    d
0   1    4    9   16
1  25   36   49   64
2  81  100  121  144

In [18]:
data.pow(2)

    a    b    c    d
0   1    4    9   16
1  25   36   49   64
2  81  100  121  144

## Performing action on single column

In [22]:
data

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [21]:
data[['a']].add(2)

    a
0   3
1   7
2  11

## Performing action on single row

In [25]:
data.loc[[0]]

   a  b  c  d
0  1  2  3  4

In [26]:
data.loc[[0]] * 2

   a  b  c  d
0  2  4  6  8